InformationRegisters/like_objectMatching.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>like_objectMatching</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>likeRef</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.like_measureUnits</v8:Type>
						<v8:Type>cfg:CatalogRef.like_conceptions</v8:Type>
						<v8:Type>cfg:CatalogRef.like_products</v8:Type>
						<v8:Type>cfg:CatalogRef.like_users</v8:Type>
						<v8:Type>cfg:CatalogRef.like_stores</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>connection</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.like_connections</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ref1C</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>docType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>matchingType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.like_matchingTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/like_objectMatching/Ext/ManagerModule.bsl
Procedure MatchingAdd(connection,
	ref1C, 
	likeRef, 
	docType, 
	matchingType) Export
	
	newMathing = InformationRegisters.like_objectMatching.CreateRecordManager();
	newMathing.connection	= connection;
	newMathing.ref1C 		= ref1C;
	newMathing.docType		= docType;
	newMathing.likeRef		= likeRef;
	newMathing.matchingType = matchingType;
	newMathing.Write();
	
EndProcedure
